[LANG]
language=Japanese (にほんご)
[FONT]
font-name=Yu Gothic UI
welcome-text-size=64
home-text-size=24
home-section-size=26
analysis-text-size=22
analysis-section-size=24
left-panel-size=18
panel-list-size=18
panel-list-label-size=22
panel-list-header-size=18
panel-list-item-size=15
panel-button-size=14
combobox-size=18
list-combobox-size=18
checkbox-size=16
radio-size=17
elem-size=12
image-button-size=16
form-text-size=17
list-text-size=18
search-edit-size=18
message-text-size=18
setting-button-size=14
process-text-size=16
properites-title-font=20
properites-section-font=18
log-list-item-text-size=14
log-list-item-sql-size=16
[ERROR]
000000=
200001=SQL 構文エラー
200002=ファイルが存在しません
200003=ファイルが破損しています
200004=パラメータエラー
200026=テーブル名が重複しています
200027=テーブル名が存在しません
200028=CSV ファイルのインポートエラー、SQL を生成できませんでした。CSV ファイルの内容と設定項目が正しいか確認してください
300001=インデックスを作成するテーブルの列が選択されていません
300002=SQL 文を空にすることはできません
300003=SQL 分析は SELECT 查询文のみサポートしています
[STRING]
home=ホーム
database=データベース
analysis=分析
view=ビュー
setting=設定
items=件記録
tables=データテーブル
views=ビュー
triggers=トリガー
columns=列
indexes=インデックス
table=テーブル
clear-all=すべてクリア
yes=はい
no=いいえ
welcome-text=CuteSqlite へようこそ
home-text1=CuteSqlite は Sqlite3 のグラフィカルユーザークライアント（GUI）ツールです。
home-text2=データベースの設計、作成、閲覧、データベースオブジェクトの処理、
home-text3=データの挿入、および保存されたデータを処理するための SQL 查询の設計と実行が可能です。
home-text4=また、他のデータベースベンダーから Sqlite データベースへデータベースとデータを移行することもできます。
db-section-text=Sqlite データベース
analysis-text1=CuteSqlite は SQL 文のパフォーマンスを分析および最適化できます。
analysis-text2=また、データベースの各テーブルのストレージ容量を分析し、
analysis-text3=データベースのパラメータを設定してデータベースを最適化できます。
perf-analysis-section-text=パフォーマンス分析
error-text=システムエラー：
create-database=新しいデータベースを作成 (Ctrl+N)
open-database=データベースを開く (Ctrl+O)
refresh-database=データベースを更新 (F5)
delete-database=リストから選択したデータベースを削除 (Del)
override-user-db=ファイルのデータを削除すると復元できません。データベースを上書きしてもよろしいですか？
create-db-success-text=データベースの作成に成功しました
open-db-exists-inlist=データベースは既に開いています。重複操作しないでください
open-db-success-text=データベースを開くことに成功しました
delete-user-db=リストから選択したデータベース "{dbName}" を削除してもよろしいですか？
delete-db-success-text=リストからデータベースを削除しました
query-editor=查询エディター
history=履歴
history-tip=履歴 (F8)
result-list=結果
result-info=情報
result-table-data=テーブルデータ
table-properties=テーブルプロパティ
exec-select-sql=現在選択した查询を実行 (F9)
exec-all-sql=すべての查询を実行 (F10)
explain-select-sql=現在選択した SQL 文を Explain (F11)
explain-query-plan-sql=現在選択した SQL 文を Explain query plan (F12)
query-page-help=自動補完機能：[Tab]->次のタブ；[Ctrl+Space]->一致するタブの一覧；[Ctrl+Enter]->すべてのタブの一覧
no-select-userdb=データベースが選択されていません
no-sql-statement=查询エディターに SQL 文が入力されていません
no-sql-content=查询エディターに SQL 文がありません
show-form-view=フォームビューを表示
export-result-as=エクスポート... (Ctrl+Alt+E)
copy-result-data=データをクリップボードにコピー
clear-all=すべてクリア
ok=OK
cancel=キャンセル
export-text-description=データのエクスポート形式を選択
csv-settings=csv オプション
csv-field-settings=列
csv-line-settings=行
csv-charset-settings=エンコーディング
excel-settings=Excel オプション
sql-settings=SQL オプション
export-fields-settings=エクスポートする列を選択
terminated-by=区切り文字
enclosed-by=囲み文字
escaped-by=エスケープ文字
field-terminated-by=列区切り文字
field-enclosed-by=列囲み文字
field-escaped-by=列エスケープ文字
line-terminated-by=改行文字
add-column-name=ヘッダーに列名を追加
csv-charset=エンコーディング
excel-column-max-size=テキスト列のサイズ制限
excel-decinmal-places=小数桁
structure-only=テーブル構造のみ
data-only=データのみ
structure-and-data=テーブル構造とデータ
select-all=すべて選択
deselect-all=すべて選択解除
save-to-file=ファイルにエクスポート
expert-fmt-error=データのエクスポートファイル形式を選択してください
terminated-by-error=「終端」の値を入力してください
enclosed-by-error=「囲み」の値を入力してください
escaped-by-error=「エスケープ文字」の値を入力してください
line-terminated-by-error=行の「終端」の値が正しくありません
excel-column-max-size-error=「テキスト列のサイズ制限」の値を入力してください
excel-decinmal-places-error=「小数桁」の値を入力してください
export-sql-error=SQL オプションを選択してください
selected-fields-error=エクスポートする列を選択してください
export-path-error=エクスポートファイルのパスを入力してください
sql-notsupport-multitable-query-error=複数テーブル查询とサブ查询の結果エクスポートはサポートされていません
export-success-text=エクスポート成功、{rows}行のデータをエクスポートしました。ファイルを開きますか？
open-the-file=ファイルを開く
export-file-exists-prompt={export-path} は既に存在します。置き換えますか？
limit-rows=行制限
offset=開始行
rows=行数
copy-all-rows-to-clipboard=すべての行をクリップボードにコピー	Ctrl+Alt+A
copy-sel-rows-to-clipboard=選択した行をクリップボードにコピー	Ctrl+Alt+H
copy-all-rows-as-sql=すべての行を SQL としてコピー	Ctrl+Alt+J
copy-sel-rows-as-sql=選択した行を SQL としてコピー	Ctrl+Alt+K
read-only=読み取り専用
filter=フィルター (Ctrl+Alt+F)
filter-in-use=フィルター使用中
refresh=更新 (Ctrl+F5)
refresh-page=更新
new-row-tip=新しい行を追加 (Ctrl+Alt+N)
copy-row-tip=行をコピー (Ctrl+Alt+C)
save-tip=保存 (Ctrl+Alt+S)
delete-tip=選択した行を削除 (Ctrl+Del)
cancel-tip=変更を元に戻す (Ctrl+Alt+Z)
revert-tip=復元
save=保存
revert=変更を元に戻す
column=列名
condition=条件
value=値
delete-confirm-text=選択した行を削除してもよろしいですか？
query=查询
result=結果
affected-rows=影響を受けた行数
exec-time=実行時間
transfer-time=転送時間
total-time=合計時間
database-create=新しいデータベースを作成		Ctrl+N
database-open=データベースを開く		Ctrl+O
database-refresh=データベースを更新		Ctrl+R
database-delete=データベースを削除		Del
database-copy=データベースをコピー...	Ctrl+P
database-export-as-sql=データベースを SQL にエクスポート	Ctrl+E
database-import-from-sql=SQL をデータベースにインポート	Ctrl+I
database-new=作成
database-new-table=テーブル
database-new-view=ビュー
database-new-trigger=トリガー
export-as-sql-text-description=選択したデータベースのテーブル/ビュー/トリガーを SQL 形式でエクスポート
select-database=選択したデータベース
database-objects=オブジェクト
structure-and-data-settings=構造とデータの設定
insert-statement-settings=INSERT 文の設定
tbl-statement-settings=データテーブル文の設定
retain-column-text=「Insert Into」で列名を保持
contain-multi-rows-text=各「Insert」文に複数の行 (VALUES) を含む
retain-table-text=古いテーブルを保持 (Create Table If Not Exists ...)
override-table-text=古いテーブルを上書き (DROP TABLE, その後 CREATE TABLE)
import-from-sql-text-description=SQL ファイル内の文を一括実行します。
abort-on-error-text=エラー発生時に中止します。
import-file-not-exists=インポートする SQL ファイルが存在しません。再度選択してください。
import-path-empty-error=インポートファイルのパスを空にすることはできません。
import=インポート
export=エクスポート
tbl-name=テーブル名
new-table=テーブルを作成
new-view=ビューを作成
new-trigger=トリガーを作成
database=データベース
schema=スキーマ
table-columns=列
table-indexes=インデックス
table-foreignkeys=外部キー
column-name=列名
data-type=データ型
default=デフォルト
check=チェック
index-name=インデックス名
index-type=インデックスタイプ
index-unique=Unique
partial-clause=部分句
comments=コメント
to-be-selected=選択待ちの列
selected=選択済みの列
up=▲
down=▼
no-columns-selected=列が選択されていません。選択してください
sql-preview=SQL プレビュー
tbl-name-empty=テーブル名を空にすることはできません
tbl-name-duplicated=テーブル名が重複しています
create-table-success-text=テーブルの作成に成功しました。
alter-table-success-text=テーブルの変更に成功しました。
rename-table-success-text=テーブル名の変更に成功しました。
delete-column-confirm-text=選択した列は 1 つ以上のインデックスによって参照されています。この列を削除すると、対応するインデックスも変更されます。削除を続行してもよろしいですか？
delete-index-confirm-text=選択したインデックスは 1 つ以上の列によって参照されています。このインデックスを削除すると、対応する列も変更されます。削除を続行してもよろしいですか？
delete-confirm-text=削除を続行してもよろしいですか？
new-view=ビューを作成
new-trigger=トリガーを作成
create-a-view-name=新しいビュー名
view-name-not-empty=新しいビュー名を空にすることはできません
view-name-duplicated=ビュー名が重複しています
create-a-trigger-name=トリガー名
trigger-name-not-empty=トリガー名を空にすることはできません
trigger-name-duplicated=トリガー名が重複しています
execute-sql-success=SQL の実行に成功しました
copy-db-success-text=データベースのコピーに成功しました
table-open=テーブルデータを開く		Alt+O
table-create=テーブルを作成		Alt+N
table-alter=テーブルを変更		Alt+A
table-rename=テーブル名を変更		Alt+M
table-truncate=テーブルを空にする		Alt+T
table-drop=テーブルを削除		Alt+Del
table-copy-as=テーブルをコピー...		Alt+P
table-sharding-as=シャーディング		Alt+G
table-export=テーブルをエクスポート...	Alt+E
table-import-sql=SQL ファイルからインポート	Alt+I
table-import-csv=CSV ファイルからインポート	Alt+J
table-manage-index=テーブルインデックスの管理
table-manage-foreign-key=テーブル外部キーの管理
properties=プロパティ
primary-key-duplicated=主キー (Primary key) が重複定義されています。
foreignkey-name=外部キー名
referencing-columns=自テーブル列
referenced-table=外部参照テーブル
referenced-columns=外部参照列
on-update=On Update
on-delete=On Delete
insert-new-column=新しい列を追加
insert-new-index=新しいインデックスを追加
insert-new-foreignkey=新しい外部キーを追加
insert-del-column=選択した列を削除
insert-del-index=選択したインデックスを削除
insert-del-foreignkey=選択した外部キーを削除
select-referenced-table-first=まず外部参照テーブルを選択してください
new-table-name=新しいテーブル名
table-name-not-empty=新しいテーブル名を空にすることはできません
table-name-duplicated=新しいテーブル名が重複しています
ai-column-exists=自動増分列 (AUTOINCREMENT) が既に存在します。
ai-fobidden-multi-pk=自動増分列 (AUTOINCREMENT) が既に存在するため、複数の主キー列は許可されていません。
ai-column-must-integer=自動増分列 (AUTOINCREMENT) は INTEGER 整数型である必要があります。
truncate-table-confirm-text=テーブルを空にすると、データは復元できません。空にしてもよろしいですか？
truncate-table-success-text=データテーブルを正常に空にしました
drop-table-confirm-text=データテーブルを削除すると、データは復元できません。削除してもよろしいですか？
drop-table-success-text=データテーブルを正常に削除しました
copy-table-text-description=コピーパラメータを設定し、データテーブルのシャーディングをサポート
from-db-name=元データベース
from-tbl-name=元テーブル
to-db-name=目標データベース
to-tbl-name=目標テーブル
table-sharding-setttings=データテーブルシャーディング
enable-table-sharding=データテーブルシャーディングを有効にする
table-suffix-begin={suffix} 開始整数
table-suffix-end={suffix} 終了整数
advanced-settings=テーブルシャーディング詳細オプション
enable-copy-data-with-strategy=戦略を有効にし、データをシャーディングテーブルにコピー
sharding-strategy-express-text=テーブル分割戦略式：{n}
preview-sql=SQL 文をプレビュー
structure-and-data-settings-unknown=構造とデータの設定が選択されていません
table-suffix-error=シャーディング整数が無効です。正しい値を入力してください
target-table-name-no-n=目標テーブルには文字列 "{n}" を含める必要があります。
sharding-strategy-express-empty=テーブル分割戦略式を空にすることはできません
copy-table-success-text=テーブルのコピーに成功しました。
start=開始
complete=完了
express-title=テーブル分割戦略式
functions=関数
express-editor-help=式 - 関数または列をダブルクリックしてエディターに挿入
import-from-csv-text-description=CSV ファイルからデータをインポートするための設定項目
source-csv-file=元 CSV ファイルパス
target-database=目標データベース
target-table=目標テーブル
columns-setttings=列
csv-data=CSV データ
column-name-on-top=1 行目を列名として使用
line-terminated-by=改行文字
csv-null-as-keyword=null/NULL を SQL キーワードとして使用
encoding=Encoding
import-success-text=インポートに成功しました
incorrect-sql-statement=誤った SQL 文
import-error-text=インポートエラー
table-manage-columns=列の管理
table-drop-column=列を削除
table-manage-indexes=インデックスの管理
table-drop-index=インデックスを削除
create-view=新しいビューを作成
open-view=ビューを開く
drop-view=ビューを削除
create-trigger=トリガーを作成
open-trigger=トリガーを開く
drop-trigger=トリガーを削除
drop-view-confirm-text=ビューを削除すると、ビューは復元できません。削除してもよろしいですか？
drop-view-success-text=ビューを正常に削除しました
drop-trigger-confirm-text=トリガーを削除すると、トリガーは復元できません。削除してもよろしいですか？
drop-trigger-success-text=トリガーを正常に削除しました
sql-templates=SQL 文テンプレート
pragma-templates=Pragmas
sql-log=SQL 履歴
clear-all=すべてクリア
use=使用
explain=Explain
top=トップ
untop=トップ解除
copy=コピー
delete=削除
today=今日
yestoday=昨日
delete-sql-log-confirm-text=SQL ログを削除してもよろしいですか？
copy-to-clipboard=クリップボードにコピーしました
save-success-text=保存に成功しました
delete-success-text=削除に成功しました
data-has-changed=データが変更されています。ページを閉じてもよろしいですか？
not-save-and-close=保存せずに閉じる
cancel=閉じるをキャンセル
table-export-as=データテーブルをエクスポート	Alt+E
export-as-sql-success-text=エクスポートに成功しました。ファイルを開きますか？
new-query=新しい查询ウィンドウを作成 (F7)
save-current=現在を保存 (Ctrl+S)
save-all=すべて保存 (Ctrl+Shift+S)
first-page=最初のページ
prev-page=前のページ
next-page=次のページ
last-page=最後のページ
save-if-data-has-changed=データが変更されています。先に保存しますか？
unsort=ソート解除
tab-close-this=閉じる
tab-close-others=他を閉じる
tab-close-left=左側をすべて閉じる
tab-close-right=右側をすべて閉じる
perf-analysis=パフォーマンス分析
perf-analysis-reports=分析レポート
store-analysis=ストレージ分析
db-params=データベースパラメータ
not-select-sql=SELECT 文のみサポートしています
open-sql-log=SQL ログを開いてパフォーマンス分析 (Ctrl+L)
add-sql-analysis=SQL 文を入力してパフォーマンス分析 (Ctrl+I)
sql-log-not-found=SQL ログが見つかりません。削除されていないか確認してください
original-sql=元の SQL 文
where-clause-analysis=WHERE 句分析
order-clause-analysis=ORDER 句分析
covering-index-analysis=カバリングインデックス分析
table-join-analysis=Joins 分析
in-table=データテーブル
where-use-column=WHERE 文で列を使用
order-use-column=ORDER 文で列を使用
covering-index-column=WHERE と ORDER 文で列を使用
where-use-index=WHERE 文でインデックスを使用
order-use-index=ORDER 文でインデックスを使用
use-covering-index=カバリングインデックスを使用
create-index-for-performance=推奨：以下の列にインデックスを作成すると、查询パフォーマンスが向上します
hint-index-for-performance=ヒント：インデックス{hintIndexName} は含まれる列をカバーしています：{hintIndexColumns}
create-covering-index-for-performance=推奨：以下の列にカバリングインデックスを作成すると、查询パフォーマンスが向上します
create-index-togeger=インデックスを作成
create-index-individ=個別にインデックスを作成
create-covering-index=カバリングインデックスを作成
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=以下の擬似コードは查询オプティマイザの実行プロセスを示しています
cycle-count=ループ統計
optimize-cycle-count=ヒント：JOIN テーブルの順序を変更すると、ループ回数を最適化して減らすことができます。
general-settings=一般設定
about=について
language-setting=インターフェース言語設定
change-language-restart-text=言語を変更するには、本ソフトウェアを再起動する必要があります。
close-and-restart=閉じて再起動
do-not-restart=再起動しない
about-us=私たちについて
about-us-description=CuteSqlite は作者 Xuehan Qin によって開発されたオープンソースソフトウェアです。
version-info=バージョン
version-info-description=CuteSqlite v0.2.2 beta (64 ビット)
feedback=フィードバック
feedback-description=ソフトウェアの問題がある場合、またはこのアプリケーションに関するアイデアや提案がある場合は、以下のフォームに記入してフィードバックしてください。
content-text=内容
license=Apache License Version 2.0
select-columns-analysis=Select 列分析
select-use-column=Select 文で以下の列を使用
select-use-column-count=列数
select-use-column-advice=推奨：SELECT 文で選択された列が{maxColumns}個を超えています。列を減らすと、查询パフォーマンスが向上します。
select-use-column-tips=ヒント：列を減らすと、查询パフォーマンスが向上します。
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=ストレージ分析：
analysis-sql=SQL 分析
open-perf-report=レポートを開く		Alt+O
drop-perf-report=レポートを削除		Alt+Del
drop-perf-report-confirm-text=レポートを削除してもよろしいですか？
store-analysis-text=データベース、データテーブル、テーブルインデックスのストレージ容量を分析できます
table-store-analysis=テーブル - {tblName}
index-store-analysis=インデックス - {idxName} - 所属テーブル:{tblName}
db-disk-used-title=ディスク空間利用率レポート、DB パス:{dbPath}
page-size-text=ページサイズ (単位：バイト)
page-size-tips=ページサイズ (単位：バイト)
file-bytes-text=ファイルサイズ (単位：バイト)
file-bytes-tips=ファイルサイズ (単位：バイト)
file-pgcnt-text=ファイル全体のページ数 (測定値)
file-pgcnt-tips=ファイル全体のページ数 (測定値)
file-pgcnt2-text=ファイル全体のページ数 (計算値)
file-pgcnt2-tips=ファイル全体のページ数 (計算値)
inuse-pgcnt-text=データを保存しているページ数 (使用中)
inuse-pgcnt-tips=データを保存しているページ数 (使用中)
free-pgcnt2-text=データを保存していないページ数 (各ヘッダー)
free-pgcnt2-tips=データを保存していないページ数 (各ヘッダー)
free-pgcnt-text=データを保存していないページ数 (計算値)
free-pgcnt-tips=データを保存していないページ数 (計算値)
av-pgcnt-text=自動クリアされたページ数
av-pgcnt-tips=自動クリアされたページ数
ntable-text=データベース内のテーブル数
ntable-tips=データベース内のテーブル数
nindex-text=インデックス数
nindex-tips=インデックス数
nmanindex-text=定義インデックス数
nmanindex-tips=定義インデックス数
nautoindex-text=暗黙インデックス数 (自動増分インデックス)
nautoindex-tips=暗黙インデックス数 (自動増分インデックス)
user-payload-text=ユーザー有効負荷保存バイト数
user-payload-tips=ユーザー有効負荷保存バイト数
all-tbl-entrycnt-title=すべてのテーブルデータ量 (件数)
all-tbl-idx-pagecnt-title=すべてのテーブルとそのインデックスのページ数
sperate-tbl-idx-pagecnt-title=すべてのテーブルとインデックスのページ数を分別計算
all-tbl-idx-report-title=すべてのテーブルとインデックス
total-pages-percent-text=データベース総数の割合
total-pages-percent-tips=データベース総数の割合
nentry-text=データ量 (件数)
nentry-tips=データ量 (件数)
storage-text=消費された保存バイト数
storage-tips=消費された保存バイト数
compressed-size-text=圧縮後に使用されたバイト数
compressed-size-tips=圧縮後に使用されたバイト数
payload-text=有効負荷のバイト数
payload-tips=有効負荷のバイト数
total-meta-text=メタデータのバイト数
total-meta-tips=メタデータのバイト数
depth-text=B ツリー深度
depth-tips=B ツリー深度
avg-payload-text=各データの平均有効負荷
avg-payload-tips=各データの平均有効負荷
avg-unused-text=各データの平均未使用バイト数
avg-unused-tips=各データの平均未使用バイト数
avg-meta-text=各データの平均メタデータ
avg-meta-tips=各データの平均メタデータ
avg-fanout-text=平均 fanout 数
avg-fanout-tips=平均 fanout 数
gap-cnt-text=非連続ページ
gap-cnt-tips=非連続ページ
mx-payload-text=各データの最大有効負荷
mx-payload-tips=各データの最大有効負荷
ovfl-cnt-text=使用されたオーバーフローデータ件数
ovfl-cnt-tips=使用されたオーバーフローデータ件数
int-pages-text=使用されたインデックスページ数
int-pages-tips=使用されたインデックスページ数
leaf-pages-text=使用されたリーフページ数
leaf-pages-tips=使用されたリーフページ数
ovfl-pages-text=使用されたオーバーフローページ数
ovfl-pages-tips=使用されたオーバーフローページ数
total-pages-text=使用された総ページ数
total-pages-tips=使用された総ページ数
int-unused-text=インデックスページ上の未使用バイト数
int-unused-tips=インデックスページ上の未使用バイト数
leaf-unused-text=リーフページ上の未使用バイト数
leaf-unused-tips=リーフページ上の未使用バイト数
ovfl-unused-text=オーバーフローページ上の未使用バイト数
ovfl-unused-tips=オーバーフローページ上の未使用バイト数
total-unused-text=すべてのページ上の未使用バイト数
total-unused-tips=すべてのページ上の未使用バイト数
all-table-report-title=すべてのテーブル (インデックス除外)
all-indices-report-title=すべてのインデックス (テーブル除外)
tbl-and-all-idx-report-title=テーブル {tblName} およびそのすべてのインデックス
tbl-only-report-title=テーブル {tblName} インデックス除外
idx-only-report-title=テーブル {tblName} のすべてのインデックス
tbl-report-title=テーブル {tblName}
idx-report-title=テーブル {tblName} のインデックス {idxName}
props-tbl-only-report-title=テーブル {tblName} ストレージ分析
props-idx-props-only-report-title=テーブル {tblName} のすべてのインデックス
db-pragma-params=PRAGMA パラメータ
db-quick-config-params=クイック設定方案
select-pragma=PRAGMA
pragma-analysis-limit-tips=近似分析 (ANALYZE) 設定の制限を查询または変更します。これは分析 (ANALYZE) コマンドが各インデックスでチェックするおおよその行数です。
pragma-application-id-tips=データベースヘッダー内のオフセット 68 にある 32 ビット符号付きビッグエンディアン「Applicatioin ID」整数を查询または設定するために使用されます。
pragma-auto-vacuum-tips=データベース内の自動クリア状態を查询または設定します。
pragma-automatic-index-tips=自動インデックス機能を查询、設定、またはクリアします。
pragma-busy-timeout-tips=ビジータイムアウト (busy timeout) の設定を查询または変更します。
pragma-cache-size-tips=各開かれたデータベースファイルごとにメモリ内に保持される SQLite 推奨の最大データベースディスクページ数を查询または変更します。
pragma-cache-spill-tips=トランザクション中にダーティキャッシュページをデータベースファイルに溢出させるページャー機能を有効または無効にします。
pragma-case-sensitive-like-tips=LIKE 演算子のデフォルト動作は ASCII 文字の大文字小文字を無視することです。したがって、デフォルトでは、'a' LIKE 'A' は true です。
pragma-cell-size-check-tips=ディスクからデータベース B ツリーページを最初に読み取る際に、他の健全性チェックを有効または無効にします。セルサイズチェックを有効にすると、データベースの破損をより早く検出でき、「拡散 (Spread)」する可能性が低くなります。
pragma-checkpoint-fullfsync-tips=チェックポイント操作の fullfsync フラグを查询または変更します。このフラグが設定されている場合、F_FULLFSYNC をサポートするシステム上でチェックポイント操作を実行する際に F_FULLFSYNC 同期方法が使用されます。CHECKPOINT_FULLFSYNC フラグのデフォルト値は OFF です。Mac OS-X のみ F_FULLFSYNC をサポートします。
pragma-collation-list-tips=現在のデータベース接続に対して定義された照合順序のリストを返します。
pragma-compile-options-tips=SQLite をビルドする際に使用されたコンパイル時オプションの名前を 1 行ずつ返します。
pragma-count-changes-tips=カウント変更フラグを查询または変更します。通常、count-changes フラグが設定されていない場合、INSERT、UPDATE、および DELETE 文はデータを返しません。
pragma-data-store-directory-tips=sqlite3_data_directory グローバル変数の値を查询または変更します。Windows オペレーティングシステムインターフェースバックエンドは、相対パス名で指定されたデータベースファイルの保存場所を決定するためにこの変数を使用します。
pragma-data-version-tips=データベースファイルが変更されたことを示します。メモリ内にデータベース内容を保存するか、屏幕上にデータベース内容を表示するインタラクティブプログラムは、PRADMA data_version コマンドを使用して、メモリを刷新して再ロードするか、屏幕表示を更新する必要があるかどうかを決定できます。
pragma-default-cache-size-tips=各開かれたデータベースファイルに割り当てられる推奨最大ディスクキャッシュページ数を查询または設定します。
pragma-defer-foreign-keys-tips=すべての外部キー制約を最外層のトランザクションのコミットまで遅延させることを示します。
pragma-empty-result-callbacks-tips=空結果コールバックフラグを查询または変更します。
pragma-encoding-tips=主データベースで使用されるテキストエンコーディング。'UTF-8'、'UTF-16le'(リトルエンディアン UTF-16 エンコーディング) または'UTF-16be'(ビッグエンディアン UTF-16 エンコーディング) のいずれか。
pragma-foreign-key-check-tips=データベースまたはテーブルに外部キー制約違反があるかチェックします
pragma-foreign-keys-tips=外部キー制約の実施を查询、設定、またはクリアします。
pragma-freelist-count-tips=データベースファイル内の未使用ページ数を返します。
pragma-full-column-names-tips=full_column_names フラグを查询または変更します。
pragma-fullfsync-tips=fullfsync フラグを查询または変更します。このフラグは、F_FULLFSYNC 同期方法をサポートするシステム上でその方法を使用するかどうかを決定します。Fullfsync フラグのデフォルト値は OFF です。Mac OS X のみ F_FULLFSYNC をサポートします。
pragma-hard-heap-limit-tips=単一プロセス内のすべてのデータベース接続のヒープメモリ量に制限を課します。
pragma-ignore-check-constraints-tips=チェック制約の強制を有効または無効にします。デフォルト設定は OFF で、これはデフォルトでチェック制約が強制されることを意味します。
pragma-incremental-vacuum-tips=最大 N 個のページをフリーリストから削除します。
pragma-integrity-check-tips=データベースに対して低レベルなフォーマットおよび整合性チェックを実行します。
pragma-journal-mode-tips=現在のデータベース接続に関連付けられたデータベースのジャーナルモードを查询または設定します。
pragma-journal-size-limit-tips=トランザクションまたはチェックポイント後にファイルシステムに残るロールバックログおよび WAL ファイルのサイズを制限します。
pragma-legacy-alter-table-tips=legacy_alter_table フラグの値を設定または查询します。
pragma-locking-mode-tips=データベース接続ロックモードを設定または查询します。ロックモードは通常モード (NORMAL) または排他モード (EXCLUSIVE) です。
pragma-max-page-count-tips=データベースファイル内の最大ページ数を查询または設定します。
pragma-mmap-size-tips=単一データベース上のメモリマップ I/O(memory-mapped I/O) に保持される最大バイト数を查询または変更します。
pragma-module-list-tips=データベース接続に登録された仮想テーブルモジュールのリストを返します。
pragma-optimize-tips=データベースを最適化しようとします。
pragma-page-count-tips=データベースファイル内の総ページ数を返します。
pragma-page-size-tips=データベースのページサイズを查询または設定します。ページサイズは 512% と 65536 の間の 2 の累乗である必要があります。
pragma-parser-trace-tips=SQLite 内部で使用される SQL パーサーのトレースをオンにします。SQLITE_DEBUG でコンパイル時に有効になります。
pragma-query-only-tips=データベースファイル上のデータ変更を防ぎます。これが有効になると、CREATE、REPORT、DROP、REPORT、または UPDATE の試みはすべて SQLITE_READONLY エラーを引き起こします。
pragma-quick-check-tips=データベースに対して低レベルなフォーマット設定および整合性チェックを実行し、UNIQUE およびインデックス整合性チェックをスキップします。
pragma-read-uncommitted-tips=READ UNCOMMITTED 隔離を查询、設定、またはクリアします。
pragma-recursive-triggers-tips=トリガーの再帰機能を查询、設定、またはクリアします。
pragma-reverse-unordered-selects-tips=有効にすると、この PRAGMA は ORDER BY 句のない多くの SELECT 文が通常とは逆の順序で結果を発行するようにします。
pragma-schema-version-tips=データベースヘッダー内のオフセット 40 处的 chema-versio 整数値を取得または設定します。
pragma-secure-delete-tips=安全削除 (secure-delete) 設定を查询または変更します。
pragma-short-column-names-tips=短列名フラグを查询または変更します。
pragma-soft-heap-limit-tips=単一プロセス内のすべてのデータベース接続について、占有するヒープメモリ量を制限します。
pragma-stats-tips=テーブルおよびインデックスに関する補助情報を返します。
pragma-synchronous-tips=「同期 (synchronous)」フラグの設定を查询または変更します。
pragma-temp-store-tips=sqlite3_temp_directory グローバル変数の値を查询または変更します。多くのオペレーティングシステムインターフェースバックエンドは、一時テーブルおよびインデックスを保存する場所を決定するためにこの変数を使用します。
pragma-threads-tips=準備された文 (prepared statement) が查询を支援するために起動する補助スレッド数。
pragma-trusted-schema-tips=スキーマ内で安全審査されていない SQL 関数および仮想表の実行を許可するかどうか。ビュー、トリガー、またはスキーマ式（CHECK 制約、DEFAULT 句、生成列、式インデックス、および/または部分インデックスなど）が安全審査されていない SQL 関数および仮想表を実行することを許可するかどうかを決定します。
pragma-user-version-tips=データベースヘッダー内のオフセット 60 处的 user-version 整数値を取得または設定します
pragma-vdbe-addoptrace-tips=完全な VDBE オペコードがコード生成中に作成されたときに表示されます。SQLite が SQLITE_DEBUG オプションでコンパイルされ、vdbe_debug がオンになっていることが前提です。
pragma-vdbe-debug-tips=VDBE デバッグをオンにします。SQLite が SQLITE_DEBUG オプションでコンパイルされていることが前提です
pragma-vdbe-listing-tips=標準出力に完全な仮想マシンオペコードリストを表示します。SQLite が SQLITE_DEBUG オプションでコンパイルされ、vdbe_debug がオンになっていることが前提です。
pragma-vdbe-trace-tips=計算時に標準出力に仮想マシンオペコードを印刷します。SQLite が SQLITE_DEBUG オプションでコンパイルされ、vdbe_debug がオンになっていることが前提です。
pragma-wal-autocheckpoint-tips=先行書き込みログ (write-ahead log)/auto-checkpoint 間隔を查询または設定します。
pragma-wal-checkpoint-tips=データベース接続 D 上のデータベース X の先行書き込みログ (write-ahead log) の内容をデータベースファイルに転送し、先行書き込みログ (write-ahead log) をリセットします。
pragma-writable-schema-tips=通常の UPDATE、INSERT、および DELETE 文を使用して sqlite_schema テーブルを変更できます。警告：このコンパイル指示を乱用すると、データベースファイルの破損を引き起こす可能性があります。
pragma-save-confirm=PRAGMA 文はデータベースの実行に影響します。以下の文を実行してもよろしいですか？
confirm-exec-text=確定&実行